In [ ]:
cd ../../

In [2]:
from tools.data_preparation import *

In [3]:
reviews_df = clean_rt_reviews()
info_df = clean_rt_movie_info()

In [4]:
rt_df = info_df.merge(reviews_df, on='id')
rt_df

,id,synopsis,rating,genre,theater_date,dvd_date,runtime,review,fresh,top_critic,date
0,3,"New York City, not-too-distant-future: Eric Pa...",R,"(Drama, Science Fiction and Fantasy)",2012-08-17,2013-01-01,108.0,A distinctly gallows take on contemporary fina...,1,0,2018-11-10
1,3,"New York City, not-too-distant-future: Eric Pa...",R,"(Drama, Science Fiction and Fantasy)",2012-08-17,2013-01-01,108.0,It's an allegory in search of a meaning that n...,0,0,2018-05-23
2,3,"New York City, not-too-distant-future: Eric Pa...",R,"(Drama, Science Fiction and Fantasy)",2012-08-17,2013-01-01,108.0,... life lived in a bubble in financial dealin...,1,0,2018-01-04
3,3,"New York City, not-too-distant-future: Eric Pa...",R,"(Drama, Science Fiction and Fantasy)",2012-08-17,2013-01-01,108.0,Continuing along a line introduced in last yea...,1,0,2017-11-16
4,3,"New York City, not-too-distant-future: Eric Pa...",R,"(Drama, Science Fiction and Fantasy)",2012-08-17,2013-01-01,108.0,... a perverse twist on neorealism...,1,0,2017-10-12
...,...,...,...,...,...,...,...,...,...,...,...
54418,2000,"Suspended from the force, Paris cop Hubert is ...",R,"(Action and Adventure, Art House and Internati...",2001-09-27,2003-02-11,94.0,The real charm of this trifle is the deadpan c...,1,1,2002-09-24
54419,2000,"Suspended from the force, Paris cop Hubert is ...",R,"(Action and Adventure, Art House and Internati...",2001-09-27,2003-02-11,94.0,NaN,0,0,2005-09-21
54420,2000,"Suspended from the force, Paris cop Hubert is ...",R,"(Action and Adventure, Art House and Internati...",2001-09-27,2003-02-11,94.0,NaN,0,0,2005-07-17
54421,2000,"Suspended from the force, Paris cop Hubert is ...",R,"(Action and Adventure, Art House and Internati...",2001-09-27,2003-02-11,94.0,NaN,0,0,2003-09-07
54422,2000,"Suspended from the force, Paris cop Hubert is ...",R,"(Action and Adventure, Art House and Internati...",2001-09-27,2003-02-11,94.0,NaN,1,0,2002-11-12

In [5]:
genre_popularity_df = rt_df[['id', 'genre', 'fresh']]
genre_popularity_df.head()

   id                                 genre  fresh
0   3  (Drama, Science Fiction and Fantasy)      1
1   3  (Drama, Science Fiction and Fantasy)      0
2   3  (Drama, Science Fiction and Fantasy)      1
3   3  (Drama, Science Fiction and Fantasy)      1
4   3  (Drama, Science Fiction and Fantasy)      1

In [6]:
genres = rt_df['genre'].unique()
unique_genres = set()
for item in genres:
    unique_genres.update(set(item))
unique_genres

{'Action and Adventure',
 'Animation',
 'Anime and Manga',
 'Art House and International',
 'Classics',
 'Comedy',
 'Cult Movies',
 'Documentary',
 'Drama',
 'Faith and Spirituality',
 'Gay and Lesbian',
 'Horror',
 'Kids and Family',
 'Musical and Performing Arts',
 'Mystery and Suspense',
 'Not listed',
 'Romance',
 'Science Fiction and Fantasy',
 'Special Interest',
 'Sports and Fitness',
 'Television',
 'Western'}

In [7]:
exploded = genre_popularity_df.explode('genre', ignore_index=True)
exploded.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120054 entries, 0 to 120053
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      120054 non-null  int64
 1   genre   120054 non-null  object
 2   fresh   120054 non-null  int64
dtypes: int64(2), object(1)
memory usage: 2.7+ MB

In [8]:
grouped = exploded.groupby('genre')['fresh'].aggregate(['count', 'sum', 'mean'])

In [9]:
sort_by_percent = grouped.sort_values('mean', ascending=False)

In [10]:
sort_by_percent.head()

                 count   sum      mean
genre
Gay and Lesbian     42    36  0.857143
Cult Movies         54    46  0.851852
Documentary       1116   864  0.774194
Classics          2121  1637  0.771806
Not listed          87    66  0.758621

In [11]:
sort_by_num_positive = grouped.sort_values('sum', ascending=False)
sort_by_num_positive.head()

                      count    sum      mean
genre
Drama                 33595  21942  0.653133
Comedy                21798  12878  0.590788
Action and Adventure  12908   7334  0.568175
Mystery and Suspense  11742   6874  0.585420
Romance                8088   5168  0.638971

In [12]:
tn_df = pd.read_csv(TN_BUDGETS)
tn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [13]:
tn_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [14]:
display_percent_nan(tn_df)

id: 0.00 % null
release_date: 0.00 % null
movie: 0.00 % null
production_budget: 0.00 % null
domestic_gross: 0.00 % null
worldwide_gross: 0.00 % null

In [16]:
tn_df = clean_tn_budgets()

In [17]:
tn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 271.2+ KB